---
kind: method
id: M:Autodesk.Revit.DB.PolylineSegments.GetVertices
source: html/d9517837-8141-235b-f6a1-3dc3ce053859.htm
---
# Autodesk.Revit.DB.PolylineSegments.GetVertices Method

Returns an array of vertices of the polyline segments.

## Syntax (C#)
```csharp
public IList<XYZ> GetVertices()
```

## Returns
Array of XYZ points.